// Плохой стиль

// Какие недостатки вы видите в стиле написания кода этого примера?

// function pow(x,n)                            // Нет пробела между аргументами
// {                                            // Открывающая фигурная скобка на отдельной строке
//   let result=1;                              // Нет пробелов перед и после знака "="
//   for(let i=0;i<n;i++) {result*=x;}          // Нет пробелов перед и после знака "=", нет пробела после ";", тело цикла не на отдельной строке
//   return result;
// }

// let x=prompt("x?",''), n=prompt("n?",'')     // Нет пробелов перед и после знака "=", нет ";" в конце строки, обе переменные на одной строке
// if (n<=0)                                    // Нет пробелов перед и после знака "<="
// {                                            // Открывающая фигурная скобка на отдельной строке
//   alert(`Степень ${n} не поддерживается, введите целую степень, большую 0`);
// }
// else
// {                                            // Открывающая фигурная скобка на отдельной строке
//   alert(pow(x,n))                            // Нет пробела между аргументами, нет ";" в конце строки
// }
